Documents/СрокиПроектаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СрокиПроектаПроизводство</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайПодрядчик</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСотрудниковСтолярка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСотрудниковМалярка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени_столярка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени_малярка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени_подрядчик</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДатыКомплектаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплектаПроизводство</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПодрядчик</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПодрядчик</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремениПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыКомплектаМонтаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплектаМонтаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КрайМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремениМонтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСотрудниковМонтаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/СрокиПроектаПроизводство/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем мИзменений, ЕстиУдалениеКомплекта;

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНачальноеЗначениеТЧ();
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ЗаполнитьПодпись(Объект.Проект));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЕстиУдалениеКомплекта = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если мИзменений.Количество() > 0 Тогда
	
		ЗаписатьВРегистрНаСервере(мИзменений, Объект.Проект);	
	
	КонецЕсли;
	Если ЕстиУдалениеКомплекта Тогда
		мКомплекты = Новый Массив;
		Для каждого х Из Объект.Комплекты Цикл
			мКомплекты.Добавить(х.Комплект);
		КонецЦикла;
		ПроверитьУдалениеКомплекта(мКомплекты, Объект.Проект);
	КонецЕсли;
	ЗаполнитьНачальноеЗначениеТЧ();
КонецПроцедуры


#КонецОбласти

#Область СобытияФормыПродолжение

&НаСервереБезКонтекста
Функция ЗаполнитьПодпись(Сделка)
	
	Если ЗначениеЗаполнено(Сделка) Тогда
		Возврат омПроекты.ПодписьСделки(Сделка);
	КонецЕсли;
	
	Возврат Новый Структура("ДатаПодписи,АвторПодписи",Дата(1,1,1),ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));

КонецФункции // ЗаполнитьПодпись()

#КонецОбласти

#Область СобытиеРеквизитов

&НаКлиенте
Процедура ПодписатьПриИзменении(Элемент)
	Если Объект.Подписать Тогда
		Объект.ДатаПодписи = ТекущаяДата();
		Объект.АвторПодписи = ПолучитьТекущегоПользователя();
	Иначе	
		Объект.ДатаПодписи 	= Дата(1,1,1);
		Объект.АвторПодписи	= ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СделкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Объект.Комплекты.Количество() = 0 Тогда 
		ОткрытьФормуВыбораСделки();
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОСменеСделке",ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения,"При смене Проекты будет очищена табличная часть. Продоллжить?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура СделкаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


#КонецОбласти 


#Область СобытиеРеквизитовПродолжение

&НаКлиенте
Процедура ПослеВопросаОСменеСделке(Результат, ДополнительныйПараметр) Экспорт
    Если Результат = КодВозвратаДиалога.ДА Тогда
        ОткрытьФормуВыбораСделки();
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыборкаПроекта(Значение, ДополнительныйПараметр) Экспорт

    Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        Возврат;
	КонецЕсли;
	
	Элементы.Проект.СписокВыбора.Очистить();
	Элементы.Проект.СписокВыбора.Добавить(Значение);
	Объект.Проект = Значение;
	Объект.Комплекты.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ЗаполнитьПодпись(Объект.Проект));
	Иначе
		ЭтаФорма.ДатаПодписи 	= Дата(1,1,1);
		ЭтаФорма.АвторПодписи 	= ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти 


#Область СобытияТЧ

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	ЕстиУдалениеКомплекта = Истина;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНачальноеЗначениеТЧ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплектаПроизводство.КрайПроизводства КАК КрайПроизводства,
		|	ЛОЖЬ КАК Изменен,
		|	ДатыКомплектаПроизводство.КрайСтолярка КАК КрайСтолярка,
		|	ДатыКомплектаПроизводство.КрайМалярка КАК КрайМалярка,
		|	ДатыКомплектаПроизводство.КрайПодрядчик КАК КрайПодрядчик,
		|	ДатыКомплектаПроизводство.НачалоПроизводства КАК НачалоПроизводства,
		|	СрокиСделкиПроизводствоКомплекты.Комплект КАК Комплект,
		|	СрокиСделкиПроизводствоКомплекты.Комментарий КАК Комментарий,
		|	СрокиСделкиПроизводствоКомплекты.КоличествоСотрудниковСтолярка КАК КоличествоСотрудниковСтолярка,
		|	СрокиСделкиПроизводствоКомплекты.КоличествоСотрудниковМалярка КАК КоличествоСотрудниковМалярка,
		|	СрокиСделкиПроизводствоКомплекты.НормаВремени_столярка КАК НормаВремени_столярка,
		|	СрокиСделкиПроизводствоКомплекты.НормаВремени_малярка КАК НормаВремени_малярка,
		|	СрокиСделкиПроизводствоКомплекты.НормаВремени_подрядчик КАК НормаВремени_подрядчик,
		|	ДатыКомплектаПроизводство.НачалоСтолярка КАК НачалоСтолярка,
		|	ДатыКомплектаПроизводство.НачалоМалярка КАК НачалоМалярка,
		|	ДатыКомплектаПроизводство.НачалоПодрядчик КАК НачалоПодрядчик,
		|	СрокиСделкиПроизводствоКомплекты.КоличествоСотрудниковСтолярка * СрокиСделкиПроизводствоКомплекты.НормаВремени_столярка КАК ЧеловекоДнейСтолярка,
		|	СрокиСделкиПроизводствоКомплекты.КоличествоСотрудниковМалярка * СрокиСделкиПроизводствоКомплекты.НормаВремени_малярка КАК ЧеловекоДнейМалярка,
		|	ДатыКомплектаПроизводство.НормаВремениПроизводства КАК НормаВремениПроизводства
		|ИЗ
		|	Документ.СрокиПроектаПроизводство.Комплекты КАК СрокиСделкиПроизводствоКомплекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплектаПроизводство КАК ДатыКомплектаПроизводство
		|		ПО СрокиСделкиПроизводствоКомплекты.Комплект = ДатыКомплектаПроизводство.Комплект
		|ГДЕ
		|	СрокиСделкиПроизводствоКомплекты.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатыКомплектаПроизводство.Комплект.Наименование";
	
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Комплект", Объект.Комплекты.Выгрузить().ВыгрузитьКолонку("Комплект"));
	Объект.Комплекты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции // ЗаполнитьНачальноеЗначениеТЧ()

&НаСервере
Функция ПолучитьДанныеКомплекта(Комплект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МонтажныеКомплектыПроизводственныеКомплекты.Ссылка КАК МонтажныйКомплект,
		|	МонтажныеКомплектыПроизводственныеКомплекты.ПроизводственныйКомплект КАК ПроизводственныйКомплект
		|ПОМЕСТИТЬ втМонтажныйКомплект
		|ИЗ
		|	Справочник.МонтажныеКомплекты.ПроизводственныеКомплекты КАК МонтажныеКомплектыПроизводственныеКомплекты
		|ГДЕ
		|	МонтажныеКомплектыПроизводственныеКомплекты.ПроизводственныйКомплект = &Комплект
		|
		|СГРУППИРОВАТЬ ПО
		|	МонтажныеКомплектыПроизводственныеКомплекты.Ссылка,
		|	МонтажныеКомплектыПроизводственныеКомплекты.ПроизводственныйКомплект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втМонтажныйКомплект.ПроизводственныйКомплект КАК ПроизводственныйКомплект,
		|	ДатыКомплектаМонтаж.НачалоМонтажа КАК НачалоМонтажа
		|ПОМЕСТИТЬ втНачалоМонтажа
		|ИЗ
		|	втМонтажныйКомплект КАК втМонтажныйКомплект
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплектаМонтаж КАК ДатыКомплектаМонтаж
		|		ПО втМонтажныйКомплект.МонтажныйКомплект = ДатыКомплектаМонтаж.Комплект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДатыКомплектаПроизводство.КрайПроизводства КАК КрайПроизводства,
		|	ЛОЖЬ КАК Изменен,
		|	ДатыКомплектаПроизводство.КрайСтолярка КАК КрайСтолярка,
		|	ДатыКомплектаПроизводство.КрайМалярка КАК КрайМалярка,
		|	ДатыКомплектаПроизводство.КрайПодрядчик КАК КрайПодрядчик,
		|	ДатыКомплектаПроизводство.НачалоПроизводства КАК НачалоПроизводства,
		|	ЕСТЬNULL(втНачалоМонтажа.НачалоМонтажа, ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоМонтажа,
		|	ДатыКомплектаПроизводство.Комплект КАК Комплект,
		|	ДатыКомплектаПроизводство.НачалоСтолярка КАК НачалоСтолярка,
		|	ДатыКомплектаПроизводство.НачалоМалярка КАК НачалоМалярка,
		|	ДатыКомплектаПроизводство.НачалоПодрядчик КАК НачалоПодрядчик
		|ИЗ
		|	РегистрСведений.ДатыКомплектаПроизводство КАК ДатыКомплектаПроизводство
		|		ЛЕВОЕ СОЕДИНЕНИЕ втНачалоМонтажа КАК втНачалоМонтажа
		|		ПО ДатыКомплектаПроизводство.Комплект = втНачалоМонтажа.ПроизводственныйКомплект
		|ГДЕ
		|	ДатыКомплектаПроизводство.Комплект = &Комплект
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатыКомплектаПроизводство.Комплект.Наименование";
		
		
	Запрос.УстановитьПараметр("Комплект", Комплект);
	тзДанныеКомплека = Запрос.Выполнить().Выгрузить();
	
	ПустаяДата = Дата(1,1,1);
	Если тзДанныеКомплека.Количество() = 0 Тогда
		стрВозврата = Новый Структура("Комплект,НачалоМонтажа,НачалоСтолярка,НачалоМалярка,НачалоПодрядчик,КрайПроизводства,КрайСтолярка,КрайМалярка,КрайПодрядчик,НачалоПроизводства"
		,Комплект,
		,ПустаяДата
		,ПустаяДата
		,ПустаяДата
		,ПустаяДата
		,ПустаяДата
		,ПустаяДата
		,ПустаяДата
		,ПустаяДата
		,ПустаяДата);	
		мВозврата = Новый Массив(1);
		мВозврата[0] = стрВозврата;
		Возврат мВозврата;
	Иначе
		Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(тзДанныеКомплека);
	КонецЕсли;
КонецФункции // ЗаполнитьНачальноеЗначениеТЧ()

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Копирование;
	
	Если НЕ ЗначениеЗаполнено(Объект.Проект) Тогда
	    ПоказатьПредупреждение(,"Не заполнена Проект."); 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКомплекта(Значение, ДополнительныйПараметр) Экспорт

    Если Значение = Неопределено Тогда  
        Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДополнительныйПараметр.ТекущиеДанные, ПолучитьДанныеКомплекта(Значение)[0]);

	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыКрайПроизводстваПриИзменении(Элемент)
	ПриИзменениеДатыТЧ();
КонецПроцедуры

&НаКлиенте
Процедура КомплектыКоличествоСотрудниковСтоляркаПриИзменении(Элемент)
	ПриИзменениеДатыТЧ();
	ТД = Элементы.Комплекты.ТекущиеДанные;
	ТД.ЧеловекоДнейСтолярка = ТД.КоличествоСотрудниковСтолярка * ТД.НормаВремени_столярка;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыНормаВремени_столяркаПриИзменении(Элемент)
	ПриИзменениеДатыТЧ();
	ТД = Элементы.Комплекты.ТекущиеДанные;
	ТД.НачалоПроизводства = омПроизводствоКлиент.РасчетНачалаДатыПроизводства(ТД);
	ТД.НачалоСтолярка = омПроизводствоКлиент.РасчетНачалаДаты(ТД.КрайСтолярка, ,ТД.НормаВремени_столярка);
	ТД.ЧеловекоДнейСтолярка = ТД.КоличествоСотрудниковСтолярка * ТД.НормаВремени_столярка;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыКрайСтоляркаПриИзменении(Элемент)
	ПриИзменениеДатыТЧ();
	ТД = Элементы.Комплекты.ТекущиеДанные;
	ТД.НачалоПроизводства = омПроизводствоКлиент.РасчетНачалаДатыПроизводства(ТД);
	ТД.НачалоСтолярка = омПроизводствоКлиент.РасчетНачалаДаты(ТД.КрайСтолярка, ,ТД.НормаВремени_столярка);
КонецПроцедуры

&НаКлиенте
Процедура КомплектыНормаВремени_маляркаПриИзменении(Элемент)
	ПриИзменениеДатыТЧ();
	ТД = Элементы.Комплекты.ТекущиеДанные;
	ТД.НачалоПроизводства = омПроизводствоКлиент.РасчетНачалаДатыПроизводства(ТД);
	ТД.НачалоМалярка = омПроизводствоКлиент.РасчетНачалаДаты(ТД.КрайМалярка,, ТД.НормаВремени_малярка);
	ТД.ЧеловекоДнейМалярка = ТД.КоличествоСотрудниковМалярка * ТД.НормаВремени_малярка;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыКрайМаляркаПриИзменении(Элемент)
	ПриИзменениеДатыТЧ();
	ТД = Элементы.Комплекты.ТекущиеДанные;
	ТД.НачалоПроизводства = омПроизводствоКлиент.РасчетНачалаДатыПроизводства(ТД);
	ТД.НачалоМалярка = омПроизводствоКлиент.РасчетНачалаДаты(ТД.КрайМалярка, ,ТД.НормаВремени_малярка);
КонецПроцедуры

&НаКлиенте
Процедура КомплектыКрайПодрядчикПриИзменении(Элемент)
	ПриИзменениеДатыТЧ();
	ТД = Элементы.Комплекты.ТекущиеДанные;
	ТД.НачалоПроизводства = омПроизводствоКлиент.РасчетНачалаДатыПроизводства(ТД);
	ТД.НачалоПодрядчик = омПроизводствоКлиент.РасчетНачалаДаты(ТД.КрайПодрядчик, ,ТД.НормаВремени_подрядчик);
КонецПроцедуры

&НаКлиенте
Процедура КомплектыНормаВремени_подрядчикПриИзменении(Элемент)
	ПриИзменениеДатыТЧ();
	ТД = Элементы.Комплекты.ТекущиеДанные;
	ТД.НачалоПроизводства = омПроизводствоКлиент.РасчетНачалаДатыПроизводства(ТД);
	ТД.НачалоПодрядчик = омПроизводствоКлиент.РасчетНачалаДаты(ТД.КрайПодрядчик, ,ТД.НормаВремени_подрядчик);
КонецПроцедуры

&НаКлиенте
Процедура КомплектыКоличествоСотрудниковМаляркаПриИзменении(Элемент)
	ТД = Элементы.Комплекты.ТекущиеДанные;
	ТД.ЧеловекоДнейМалярка = ТД.КоличествоСотрудниковМалярка * ТД.НормаВремени_малярка;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыНормаВремениПроизводстваПриИзменении(Элемент)
	ПриИзменениеДатыТЧ();
КонецПроцедуры


#КонецОбласти 


#Область СобытияТЧПродолжение

&НаКлиенте
Процедура ПриИзменениеДатыТЧ()

	ТД = Элементы.Комплекты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТД.НачалоПроизводства = омПроизводствоКлиент.РасчетНачалаДатыПроизводства(ТД);
	ТД.Изменен = Истина;
	
КонецПроцедуры // ПриИзменениеДатыТЧ()


#КонецОбласти 


#Область Команды

&НаКлиенте
Процедура ЗаполнитьКомплекты(Команда)
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		ЗаполнитьКомплектыНаСервере();
		КомплектыПриИзменении();
	Иначе	
	    ПоказатьПредупреждение(,"Не заполнена Проект.");
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область КомандыПродолжение

&НаСервере
Процедура ЗаполнитьКомплектыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплектаПроизводство.НачалоПроизводства КАК НачалоПроизводства,
		|	ДатыКомплектаПроизводство.КрайПроизводства КАК КрайПроизводства,
		|	ИзделияКомплект.Ссылка КАК Комплект
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплектаПроизводство КАК ДатыКомплектаПроизводство
		|		ПО (ДатыКомплектаПроизводство.Комплект = ИзделияКомплект.Ссылка)
		|ГДЕ
		|	ИзделияКомплект.Проект = &Проект
		|	И НЕ ИзделияКомплект.Ссылка В (&Комплекты)
		|	И НЕ ИзделияКомплект.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	Запрос.УстановитьПараметр("Комплекты", Объект.Комплекты.Выгрузить().ВыгрузитьКолонку("Комплект"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.Комплекты.Добавить(), Выборка);
	КонецЦикла;
	
	
	
КонецПроцедуры // ЗаполнитьКомплектыНаСервере()


#КонецОбласти

&НаСервереБезКонтекста
Процедура ЗаписатьВРегистрНаСервере(мИзменений, Сделка)

	Для каждого х Из мИзменений Цикл
	
		МенеджерЗаписей = РегистрыСведений.ДатыКомплектаПроизводство.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Комплект = х.Комплект;
		МенеджерЗаписей.Прочитать();
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписей,х);
		МенеджерЗаписей.Проект = Сделка;
		
		МенеджерЗаписей.Записать();
	
	КонецЦикла;	

КонецПроцедуры // ЗаписатьВРегистрНаСервере()

 &НаСервереБезКонтекста
Процедура ПроверитьУдалениеКомплекта(мКомплекты, Сделка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплектаПроизводство.Комплект КАК Комплект
		|ИЗ
		|	РегистрСведений.ДатыКомплектаПроизводство КАК ДатыКомплектаПроизводство
		|ГДЕ
		|	ДатыКомплектаПроизводство.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если мКомплекты.Найти(Выборка.Комплект) = Неопределено Тогда
			НаборЗаписей = РегистрыСведений.ДатыКомплектаПроизводство.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Комплект.Установить(Выборка.Комплект);
			
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры // 	ПроверитьУдалениеКомплекта(мКомплекты);¶()

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()

	Возврат ПараметрыСеанса.ТекущийПользователь;

КонецФункции // ПолучитьТекущегоПользователя()

&НаКлиенте
Процедура ОткрытьФормуВыбораСделки()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",						Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",				Ложь);
	ПараметрыФормы.Вставить("НаименованиеСрока",				"СрокиПроектаПроизводство");
	ПараметрыФормы.Вставить("ОтсутствующиеВПланированииСделки",	Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыборкаПроекта", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОткрытьФормуВыбораСделки()

&НаКлиенте
Процедура КомплектыПриИзменении(Элемент = Неопределено)
	
	ПустаяДата = Дата(1,1,1);
	
	Объект.КрайПроизводства = ПустаяДата;
	Объект.КрайМалярка 		= ПустаяДата;
	Объект.КрайПодрядчик 	= ПустаяДата;
	Объект.КрайСтолярка 	= ПустаяДата;
	
	Для каждого х Из Объект.Комплекты Цикл
		Если х.КрайПроизводства > Объект.КрайПроизводства Тогда
			Объект.КрайПроизводства = х.КрайПроизводства;
		КонецЕсли;
		Если х.КрайМалярка > Объект.КрайМалярка Тогда
			Объект.КрайМалярка = х.КрайМалярка;
		КонецЕсли;
		Если х.КрайПодрядчик > Объект.КрайПодрядчик Тогда
			Объект.КрайПодрядчик = х.КрайПодрядчик;
		КонецЕсли;
		Если х.КрайСтолярка > Объект.КрайСтолярка Тогда
			Объект.КрайСтолярка = х.КрайСтолярка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыКомплектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(объект.Проект) Тогда
	
		ПоказатьПредупреждение(,"Не заполнена Проект");
		Возврат;
	
	КонецЕсли;
	
	ДополнительныйПараметр = Новый Структура("ТекущиеДанные", Элемент.Родитель.ТекущиеДанные);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораКомплекта",ЭтаФорма,ДополнительныйПараметр);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Ложь);
	ПараметрыФормы.Вставить("Проект",Объект.Проект);
	
	НеПоказыватьВВыборе = СуществующиеКомплектыСделки(Объект.Проект);
	
	Для каждого х Из Объект.Комплекты Цикл
	
		НеПоказыватьВВыборе.Добавить(х.Комплект);	
	
	КонецЦикла;
	ПараметрыФормы.Вставить("НеПоказыватьВВыборе",НеПоказыватьВВыборе);
	
	ОткрытьФорму("Справочник.ИзделияКомплект.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СуществующиеКомплектыСделки(Сделка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СрокиСделкиКомплекты.Комплект КАК Комплект
		|ИЗ
		|	Документ.СрокиПроектаПроизводство.Комплекты КАК СрокиСделкиКомплекты
		|ГДЕ
		|	СрокиСделкиКомплекты.Ссылка.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Комплект");
	
	
КонецФункции // СуществующиеКомплектыСделки()



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	мИзменений = Новый Массив;
	
	Для каждого х Из Объект.Комплекты Цикл
		Если х.Изменен Тогда
			стСтрока = Новый Структура(
			"Комплект,НачалоПроизводства,НачалоМонтажа,НачалоМалярка,НачалоСтолярка,НачалоПодрядчик,КрайПроизводства,КрайСтолярка,КрайМалярка,КрайПодрядчик,НормаВремениПроизводства"
			, );
			ЗаполнитьЗначенияСвойств(стСтрока, х);
			мИзменений.Добавить(стСтрока);
			х.Изменен = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
